# NumericRevisionSettings Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
NumericRevisionSettings Members
NumericRevisionSettings Class Constructors Methods Properties See Also
---
The NumericRevisionSettings type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| NumericRevisionSettings()()()() | Constructs a NumericRevisionSettings with a simple, default numbering sequence. |
| NumericRevisionSettings(NumericRevisionSettings) | Constructs a new copy of the input NumericRevisionSettings object. |
| NumericRevisionSettings(Int32, String, String) | Constructs a NumericRevisionSettings object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the NumericRevisionSettings |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| IsEqual | Determines whether a specified NumericRevisionSettings is the same as 'this'. |
| IsValid | Determines whether the NumericRevisionSettings object is in a valid state. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| MinimumDigits | Controls the minimum number of digits for a revision number. |
| Prefix | The prefix string that will be prepended to the number of each revision with Numeric RevisionNumberingType. |
| StartNumber | The start number for the sequence. |
| Suffix | The suffix string that will be appended to the number of each revision with Numeric RevisionNumberingType. |

# See Also
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace